; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)

  (:predicates
    (on ?x - block ?y - block)       ; block ?x is on top of block ?y
    (ontable ?x - block)             ; block ?x is on the table
    (clear ?x - block)               ; no block is on top of ?x
    (handempty)                      ; gripper is not holding anything
    (holding ?x - block)             ; gripper is holding block ?x
  )

  (:action pick-up
    :parameters (?x - block)
    :precondition (and 
      (clear ?x)           ; nothing on top of block
      (ontable ?x)         ; block is on table
      (handempty)          ; gripper is empty
    )
    :effect (and 
      (holding ?x)         ; now holding the block
      (not (ontable ?x))   ; block no longer on table
      (not (clear ?x))     ; block no longer clear (in gripper)
      (not (handempty))    ; gripper no longer empty
    )
  )

  (:action put-down
    :parameters (?x - block)
    :precondition (holding ?x)    ; must be holding the block
    :effect (and 
      (ontable ?x)         ; block now on table
      (clear ?x)           ; block is now clear
      (handempty)          ; gripper is now empty
      (not (holding ?x))   ; no longer holding block
    )
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and 
      (holding ?x)         ; must be holding block x
      (clear ?y)           ; block y must be clear
    )
    :effect (and 
      (on ?x ?y)           ; x is now on y
      (clear ?x)           ; x is now clear
      (handempty)          ; gripper is now empty
      (not (holding ?x))   ; no longer holding x
      (not (clear ?y))     ; y is no longer clear
    )
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and 
      (on ?x ?y)           ; x must be on y
      (clear ?x)           ; x must be clear
      (handempty)          ; gripper must be empty
    )
    :effect (and 
      (holding ?x)         ; now holding x
      (clear ?y)           ; y is now clear
      (not (on ?x ?y))     ; x no longer on y
      (not (clear ?x))     ; x no longer clear
      (not (handempty))    ; gripper no longer empty
    )
  )
)

; problem
(define (problem tamp-iteration-1)
  (:domain blocksworld)

  (:objects
    b c g m r y - block
  )

  (:init
    (ontable r)
    (ontable g)
    (ontable b)
    (ontable y)
    (ontable m)
    (ontable c)
    (clear r)
    (clear g)
    (clear b)
    (clear y)
    (clear m)
    (clear c)
    (handempty)
  )

  (:goal (and
    (on c m)
    (on m y)
    (on y b)
    (on b r)
    (on r g)
    (ontable g)
    (clear c)
  ))
)

; plan
1. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 2 of 7
2. (stack r g)
   deleted: (holding r) (clear g)
   added: (on r g) (clear r) (handempty)
   goals met: 3 of 7
3. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 3 of 7
4. (stack b r)
   deleted: (holding b) (clear r)
   added: (on b r) (clear b) (handempty)
   goals met: 4 of 7
5. (pick-up y)
   deleted: (ontable y) (clear y) (handempty)
   added: (holding y)
   goals met: 4 of 7
6. (stack y b)
   deleted: (holding y) (clear b)
   added: (on y b) (clear y) (handempty)
   goals met: 5 of 7
7. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 5 of 7
8. (stack m y)
   deleted: (holding m) (clear y)
   added: (on m y) (clear m) (handempty)
   goals met: 6 of 7
9. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 5 of 7
10. (stack c m)
   deleted: (holding c) (clear m)
   added: (on c m) (clear c) (handempty)
   goals met: 7 of 7
